{"rating": ["8.8"], "review_title2": ["Insanely Brilliant ! Nolan has outdone himself !!"], "review_title3": ["Nolan's first true masterpiece"], "name": ["Inception\n                   ", "\n            "], "review_author2": ["Naman Kapur"], "review_title1": ["Matrix but in dreamworld? Nah."], "url": "http://www.imdb.com/find?q=leonardo+dicaprio+&s=nm", "review_author_place3": ["from Canada"], "review": "https://www.imdb.com/title/tt1375666/reviews?ref_=tt_urv", "review_author_place1": ["from United Kingdom"], "data": ["\n                    ", "PG-13\n", "|", "                    ", "\n                        2h 28min\n                    ", "\n", "|", "\n", "Action", ", \n", "Mystery", ", \n", "Sci-Fi", "\n", "|", "\n", "16 July 2010 (USA)\n", "\n", "            "], "review_author3": ["technofunkie"], "review_author_place2": ["from India"], "image_link": ["http://ia.media-imdb.com/images/M/MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw@@._V1_UX182_CR0,0,182,268_AL_.jpg"], "user": ["1,346,906"], "link": "https://www.imdb.com/name/nm0000138/?ref_=fn_nm_nm_1", "review_author1": ["Simon Bradley"], "review_data1": ["\nI'd like to keep my review rather to the point."], "movie_link": "http://www.imdb.com/title/tt1375666/?ref_=nm_knf_i1", "review_data3": ["\nUsually I try to be careful with over hyping a film, or setting the\nexpectations too high, as film geeks all are guilty for, however for\nChristopher Nolan's Inception, this really is not possible."], "review_data2": ["\nWhat is the most resilient parasite? An Idea! Yes, Nolan has created\nsomething with his unbelievably, incredibly and god- gifted mind which\nwill blow the minds of the audience away. The world premiere of the\nmovie, directed by Hollywood's most inventive dreamers, was shown in\nLondon and has already got top notch reviews worldwide and has scored\nmaximum points! Now the question arises what the movie has that it\ndeserve all this?"]}
{"rating": ["7.7"], "review_title2": ["One of a Kind"], "review_title3": ["bravo"], "name": ["Titanic\n                   ", "\n            "], "review_author2": ["Boyo-2"], "review_title1": ["Timeless, moving, and epic"], "url": "http://www.imdb.com/find?q=leonardo+dicaprio+&s=nm", "review_author_place3": ["from Atlanta, GA"], "review": "https://www.imdb.com/title/tt0120338/reviews?ref_=tt_urv", "review_author_place1": ["from Virginia"], "data": ["\n                    ", "PG-13\n", "|", "                    ", "\n                        3h 14min\n                    ", "\n", "|", "\n", "Drama", ", \n", "Romance", "\n\n", "|", "\n", "19 December 1997 (USA)\n", "\n", "            "], "review_author3": ["Jasson Cresanto (ragesaint@aol.com)"], "review_author_place2": ["11 December 1998"], "image_link": ["http://ia.media-imdb.com/images/M/MV5BMjExNzM0NDM0N15BMl5BanBnXkFtZTcwMzkxOTUwNw@@._V1_UX182_CR0,0,182,268_AL_.jpg"], "user": ["738,842"], "link": "https://www.imdb.com/name/nm0000138/?ref_=fn_nm_nm_1", "review_author1": ["v2pointoh"], "review_data1": ["\nEvery once in a while the conversation will turn to \"favorite movies.\"\nI'll mention Titanic, and at least a couple people will snicker. I pay\nthem no mind because I know that five years ago, these same people were\nmoved to tears by that very movie. And they're too embarrassed now to\nadmit it."], "movie_link": "http://www.imdb.com/title/tt0120338/?ref_=nm_knf_i3", "review_data3": ["\n\nFirstly and foremostly, I am a guy, which (in most cases) means I did not go\n see Titanic to see DiCaprio...although I think he can be a great actor. \n Reading through earlier comments, i grew a bit weary of hearing about lame\n script and shallow characters.  I went to see a ship sink...the plot and\n the characters were, at least to me, a kind of icing on the Cake.  I\n actually think a lot of the characters were done well; that is, by the time\n they die in freezing water, you actually felt a tinge of sadness for them. \n But , by the time Titanic was over, I was sufficiently moved to make me\n tell people that it was a great movie.  Kate Winslet was good, Kathy Bates\n was perfect, Leo was ok (I'll give you people that - I've seen him shine\n like I know he can ... Basketball Diaries, Romeo & Juliet).  But ultimately,\n the Titanic sinks...and it was absolutely stunning.  Bravo to Cameron.  He\n didn't just show us a large ship sinking, he showed us the back half of it\n crashing down on a hundred freezing, drowning people; he showed us a third\n class mother attempting to sing her children to sleep because she knew they\n were all doomed (broke my heart - i cried the most right there at that\n point), he showed people who worked extremely hard to get OUT of the bowels\n of the ship only to be sucked back in when a random window shattered and\n the water carried them on back in...detail.  I like detail in a movie. \n Very impressive job.\n"], "review_data2": ["\n\nTo all the miserable people who have done everything from complain about the\ndialogue, the budget, the this and the that....who wants to hear it?  IF you\nmissed the point of this beyond-beautiful movie, that's your loss.  The rest\nof us who deeply love this movie do not care what you think.  I am a\nthirthysomething guy who has seen thousands of movies in my life, and this\none stands in its own entity, in my book.  It was not supposed to be a\ndocumentary, or a completely factual account of what happened that night.\nIt is the most amazing love story ever attempted.  I know that it is the\ncynical 90's and the millennium has everyone in a tizzy, but come on.\nSomeone on this comments board complained that it made too much money! How\nlame is that?  It made bundles of money in every civilized country on the\nplanet, and is the top grossing film in the planet.  I will gladly side with\nthe majority this time around.\nOkay, cynics, time to crawl back under your rock, I am\ndone.\n"]}
{"rating": ["8.2"], "review_title2": ["DiCaprio gives the best performance of his career."], "review_title3": ["Good or Bad depending on what you want..."], "name": ["The Wolf of Wall Street\n                   ", "\n            "], "review_author2": ["Brent Hankins"], "review_title1": ["Don't waste your time"], "url": "http://www.imdb.com/find?q=leonardo+dicaprio+&s=nm", "review_author_place3": ["from United States"], "review": "https://www.imdb.com/title/tt0993846/reviews?ref_=tt_urv", "review_author_place1": ["6 January 2014"], "data": ["\n                    ", "R\n", "|", "                    ", "\n                        3h\n                    ", "\n", "|", "\n", "Biography", ", \n", "Comedy", ", \n", "Crime", "\n", "|", "\n", "25 December 2013 (USA)\n", "\n", "            "], "review_author3": ["Koodle0101"], "review_author_place2": ["from www.nerdrep.com"], "image_link": ["http://ia.media-imdb.com/images/M/MV5BMjIxMjgxNTk0MF5BMl5BanBnXkFtZTgwNjIyOTg2MDE@._V1_UX182_CR0,0,182,268_AL_.jpg"], "user": ["681,963"], "link": "https://www.imdb.com/name/nm0000138/?ref_=fn_nm_nm_1", "review_author1": ["luci1977"], "review_data1": ["\nI've always thought that there must be a very good reason for a movie\nto last 3 hours. Wolf of wall street does last 3 hours but there no\nshadow of a good reason for it. It could have lasted 1 hour and it\nwould have been already too long."], "movie_link": "http://www.imdb.com/title/tt0993846/?ref_=nm_knf_i2", "review_data3": ["\nThis movie is NOT rated \"R\" but rather \"NC-17\" if not \"X\" rated. I got\ntired and almost fell asleep a some parts. About half of the movie is\nnothing more then them drinking, partying, and doing drugs. Literally.\nAlso a bunch of pornography. It's like a college gone crazy for half of\nthe movie (you see like 40+ boobies, a bunch of sex scenes, and a few\nshorts glimpse of a penis AND vagina)I got so excessive everyone I went\nwith debated on leaving..."], "review_data2": ["\nIn the mid-1990s, Jordan Belfort (Leonardo DiCaprio) and the rest of\nhis associates from brokerage firm Stratton Oakmont became the very\ndefinition of excess and debauchery, their offices a boiler room fueled\nby cocaine and greed. High pressure sales tactic and less-than-legal\nbehind-the-scenes manipulation bred plenty of twenty-something\nmillionaires, and Belfort built himself an empire at the top of the\nheap. His rise and fall is chronicled in The Wolf of Wall Street, based\non the memoir of the same name."]}
